Revit 2027 API
SpatialElement.Name Property
A human readable name for the Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override string Name { set; }
Public Overrides WriteOnly Property Name As String
	Set
public:
virtual property String^ Name {
	void set (String^ value) override;
}
abstract Name : string with set
override Name : string with set
Property Value
String
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the name of the element cannot be changed.
ArgumentException | Thrown when the element requires a unique name and a non-unique name is set.
Remarks
The Name property is a human readable name for the element, such as Wall.
See Also
Reference
SpatialElement Class
Autodesk.Revit.DB Namespace